export const moviesData = [
  {
    title: 'Гаррі Поттер і філософський камінь',
    generalInfo: {
      year: 2001,
      country: 'Велика Британія, США',
      studio: 'Warner Bros. Pictures',
      genre: ['фентезі', 'пригоди', 'сімейний'],
    },
    director: 'Кріс Коламбус',
    actors: [
      'Деніел Редкліфф',
      'Руперт Грінт',
      'Емма Вотсон',
      'Роббі Колтрейн',
      'Алан Рікман',
    ],
    plot: 'Історія про хлопчика-сироту, який у свій одинадцятий день народження дізнається, що він є чарівником, і вирушає на навчання до школи магії Гоґвортс.',
  },
  {
    title: 'Форсаж 2',
    generalInfo: {
      year: 2003,
      country: 'США, Німеччина',
      studio: 'Universal Pictures',
      genre: ['бойовик', 'трилер', 'кримінал'],
    },
    director: 'Джон Сінглтон',
    actors: [
      'Пол Вокер',
      'Тайріз Гібсон',
      'Єва Мендес',
      'Коул Гаузер',
      'Ludacris',
    ],
    plot: "Колишній поліцейський Браян О'Коннер поєднує сили зі своїм старим другом Романом Пірсом, щоб під прикриттям перевезти гроші наркобарона та очистити свої імена перед законом.",
  },
  {
    title: 'Темний лицар',
    generalInfo: {
      year: 2008,
      country: 'США, Велика Британія',
      studio: 'Warner Bros. Pictures, Legendary Pictures',
      genre: ['фантастика', 'бойовик', 'трилер', 'кримінал'],
    },
    director: 'Крістофер Нолан',
    actors: [
      'Крістіан Бейл',
      'Гіт Леджер',
      'Аарон Екхарт',
      'Мэггі Джилленхол',
      'Гері Олдмен',
    ],
    plot: 'Бетмен піднімає ставки у війні зі злочинністю в Готем-сіті. За допомогою лейтенанта Джима Гордона та прокурора Гарві Дента він має намір знищити кримінальні організації, але на заваді стає новий геній хаосу — Джокер.',
  },
];
